In [1]:
import numpy as np
import pandas as pd

In [2]:
ser1 = pd.Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [3]:
ser1 = ser1*2
ser1

A    0
B    2
C    4
dtype: int32

In [4]:
ser1['B']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3] # 3 tidak inklusif

A    0
B    2
C    4
dtype: int32

In [8]:
ser1[0:2]

A    0
B    2
dtype: int32

In [9]:
ser1[['A','C']] # kalau lebih dari 1 baris, panggil menggunakan list

A    0
C    4
dtype: int32

In [10]:
ser1>3

A    False
B    False
C     True
dtype: bool

In [11]:
ser1[ser1>3]

C    4
dtype: int32

In [12]:
ser1[ser1<1] = 10
ser1

A    10
B     2
C     4
dtype: int32

In [13]:
df = pd.DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','CHI'],columns=['A','B','C','D','E'])
df

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [14]:
df['C']

NYC     2
LA      7
SF     12
DC     17
CHI    22
Name: C, dtype: int32

In [15]:
df[['A','C','E']] # kalau lebih dari 1 baris, panggil menggunakan list

      A   C   E
NYC   0   2   4
LA    5   7   9
SF   10  12  14
DC   15  17  19
CHI  20  22  24

In [16]:
df[df>8]

        A     B     C     D     E
NYC   NaN   NaN   NaN   NaN   NaN
LA    NaN   NaN   NaN   NaN   9.0
SF   10.0  11.0  12.0  13.0  14.0
DC   15.0  16.0  17.0  18.0  19.0
CHI  20.0  21.0  22.0  23.0  24.0

In [18]:
df>8 # Perhatikan perbedaannya dengan yang diatas

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False   True
SF    True   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [17]:
df[df['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [19]:
# label index udah gapake ix
df.ix['LA']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [22]:
df.loc['LA'] # manggil row berdasarkan nama baris

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [26]:
df.iloc[1] # manggil row berdasarkan index baris

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32